app/views/comments/_comment.html.erb

  <%= comment.content %>
  - <%= time_tag comment.created_at, nil, data: { local: "time-ago" } %>
---
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["post_id", 4], ["content", "helal olsun!\n"], ["created_at", "2024-10-20 11:37:54.022039"], ["updated_at", "2024-10-20 11:37:54.022039"], ["user_id", 3]]