app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  <p>
  <strong><%= pluralize post.comments.count, "comment Sayısı" %></strong>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  <div id="comments">
    <% post.comments.each do |comment| %>