app/controllers/comments_controller.rb

    def create
      # Yorum oluştururken kullanıcının kim olduğunu belirleyin
      comment = @post.comments.new(comment_params)
      comment.user = current_user  # Yorumun sahibini güncel kullanıcı yap

      if comment.save
---
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["post_id", 1], ["content", "guzel post"], ["created_at", "2024-09-18 15:54:51.098532"], ["updated_at", "2024-09-18 15:54:51.098532"], ["user_id", 1]]