app/controllers/posts_controller.rb

  def index
    @posts = Post.all # Sadece giriş yapan kullanıcının gönderilerini getirir
---
SELECT "posts".* FROM "posts"

  def create
    @post = current_user.posts.build(post_params) # Yeni gönderiyi mevcut kullanıcıya ait olarak oluşturur

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "asdaasdsad"], ["content", nil], ["created_at", "2024-09-18 15:54:44.671752"], ["updated_at", "2024-09-18 15:54:44.671752"], ["user_id", 1]]

  def destroy
    if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]